# /Zakiev_Marat_dz_11/zakiev_marat_lesson_11_2.py
# zakiev_marat_lesson_11_2
# -------------------------------------------------------------------------------------------
# 2. Создайте собственный класс-исключение, обрабатывающий ситуацию деления на ноль.
# Проверьте его работу на данных, вводимых пользователем.
# При вводе нуля в качестве делителя программа должна корректно обработать эту ситуацию и не завершиться с ошибкой.
# -------------------------------------------------------------------------------------------
